In [2]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(42) 

data = {
    "Date": pd.date_range(start="2024-01-01", end="2024-12-31", freq="D"),
    "Employee": np.random.choice(["Alice", "Bob", "Charlie", "Diana", "Eve"], 366),
    "Department": np.random.choice(["HR", "Finance", "Engineering", "Sales"], 366),
    "Hours Worked": np.random.uniform(4, 10, 366).round(1), 
}

df = pd.DataFrame(data)

In [7]:
df

          Date Employee   Department  Hours Worked
0   2024-01-01    Diana        Sales           8.2
1   2024-01-02      Eve        Sales           6.3
2   2024-01-03  Charlie      Finance           8.4
3   2024-01-04      Eve  Engineering           9.5
4   2024-01-05      Eve  Engineering           9.8
..         ...      ...          ...           ...
361 2024-12-27    Diana      Finance           7.3
362 2024-12-28    Diana  Engineering           9.2
363 2024-12-29      Eve  Engineering           7.2
364 2024-12-30    Diana           HR           5.1
365 2024-12-31      Eve           HR           5.8

[366 rows x 4 columns]

### Average Hours Worked Per Department Each Month

In [8]:
df['Month'] = df['Date'].dt.to_period('M')

In [9]:
df.head()

        Date Employee   Department  Hours Worked    Month
0 2024-01-01    Diana        Sales           8.2  2024-01
1 2024-01-02      Eve        Sales           6.3  2024-01
2 2024-01-03  Charlie      Finance           8.4  2024-01
3 2024-01-04      Eve  Engineering           9.5  2024-01
4 2024-01-05      Eve  Engineering           9.8  2024-01

In [10]:
averageHoursPerDepartment = df.groupby(['Month', "Department"])['Hours Worked'].mean().unstack()

In [11]:
averageHoursPerDepartment

Department  Engineering   Finance        HR     Sales
Month
2024-01        6.588889  7.100000  6.180000  6.477778
2024-02        6.980000  7.428571  6.480000  6.457143
2024-03        7.925000  7.233333  6.888889  7.983333
2024-04        7.420000  5.383333  7.780000  7.285714
2024-05        7.087500  6.783333  6.718182  6.766667
2024-06        6.040000  6.400000  7.700000  6.157143
2024-07        6.800000  7.060000  8.463636  7.025000
2024-08        6.644444  5.650000  7.720000  6.790000
2024-09        7.500000  7.090909  7.012500  7.333333
2024-10        6.925000  7.128571  7.433333  7.614286
2024-11        7.042857  6.883333  6.100000  6.314286
2024-12        7.214286  6.933333  7.075000  6.466667

####  Least Productive Employee in Each Department per Quarter

In [12]:
df['Quarter'] = df['Date'].dt.to_period('Q')
df.head()

        Date Employee   Department  Hours Worked    Month Quarter
0 2024-01-01    Diana        Sales           8.2  2024-01  2024Q1
1 2024-01-02      Eve        Sales           6.3  2024-01  2024Q1
2 2024-01-03  Charlie      Finance           8.4  2024-01  2024Q1
3 2024-01-04      Eve  Engineering           9.5  2024-01  2024Q1
4 2024-01-05      Eve  Engineering           9.8  2024-01  2024Q1

In [14]:
productivity = df.groupby(['Quarter','Department','Employee'])['Hours Worked'].sum()

In [15]:
productivity

Quarter  Department   Employee
2024Q1   Engineering  Alice       25.2
                      Bob         22.3
                      Charlie      6.3
                      Diana       43.0
                      Eve         29.1
                                  ...
2024Q4   Sales        Alice       17.1
                      Bob         24.0
                      Charlie     28.7
                      Diana       36.0
                      Eve         30.5
Name: Hours Worked, Length: 80, dtype: float64

In [17]:
leastProductive = productivity.groupby(['Quarter', "Department"]).idxmin()

In [18]:
leastProductive

Quarter  Department
2024Q1   Engineering    (2024Q1, Engineering, Charlie)
         Finance                (2024Q1, Finance, Bob)
         HR                      (2024Q1, HR, Charlie)
         Sales                  (2024Q1, Sales, Alice)
2024Q2   Engineering      (2024Q2, Engineering, Alice)
         Finance              (2024Q2, Finance, Diana)
         HR                          (2024Q2, HR, Eve)
         Sales                    (2024Q2, Sales, Eve)
2024Q3   Engineering        (2024Q3, Engineering, Eve)
         Finance                (2024Q3, Finance, Bob)
         HR                          (2024Q3, HR, Eve)
         Sales                    (2024Q3, Sales, Eve)
2024Q4   Engineering    (2024Q4, Engineering, Charlie)
         Finance              (2024Q4, Finance, Alice)
         HR                          (2024Q4, HR, Eve)
         Sales                  (2024Q4, Sales, Alice)
Name: Hours Worked, dtype: object

#### Best Performing Department for the Year

In [19]:
bestDepartment = df.groupby("Department")['Hours Worked'].sum()

In [20]:
bestDepartment

Department
Engineering    572.5
Finance        570.8
HR             794.4
Sales          619.5
Name: Hours Worked, dtype: float64